class CafeteriaInfo {
  final String title;
  final List<String> body;

  const CafeteriaInfo({required this.title, required this.body});
}

const List<CafeteriaInfo> cafeteriaInfos = [
  CafeteriaInfo(
    title: 'バブレストラン (8号館1階)',
    body: [
      '8号館1階にある「バブレストラン8(通称：8食)」を選べる定食コーナーや北海道直送の札幌ラーメンコーナーなど5つのコーナーと売店で構成されている湘南キャンパス最大席数を誇る大型食堂です。',
      '',
      '**・営業時間**',
      '月～金 11:00～14:00',
      '**・平均価格**',
      '平均500円',
      '**・決済方法**',
      '現金、電子決済',
    ],
  ),
  CafeteriaInfo(
    title: 'FAMILIA KITCHEN (コムスクエア)',
    body: [
      '「毎日来ても飽きない食堂」をコンセプトに3種類の日替わりメニュー・選べる小鉢・限定のきまぐれメニューなど楽しい仕掛けを用意してお客様をお待ちしております。看板メニューの「から揚げ定食」は日本唐揚協会認定をいただき、年間30万食売れています。',
      '',
      '**・営業時間**',
      '月～金 11:00～14:00',
      '**・平均価格**',
      '平均550円',
      '**・決済方法**',
      '現金、電子決済、クレジット',
    ],
  ),
  CafeteriaInfo(
    title: 'ふうりゅう 東海大学店 (ログハウス)',
    body: [
      '東京都足立区の30年以上続く担々麺の名店が湘南キャンパスにオープンしました。麺類が中心ですが、定食やカレーライスなどもあります。マイルドな辛さ、ゴマの濃厚スープが癖になる担々麺を是非ご賞味ください。',
      '',
      '**・営業時間**',
      '月～土 11:00～14:00',
      '**・平均価格**',
      '平均600円',
      '**・決済方法**',
      '現金、電子決済',
    ],
  ),
  CafeteriaInfo(
    title: 'Café Lounge (14号館地下1階)',
    body: [
      'ボリュームサンド、パスタやカレーなどのカフェメニューを、スープやサラダとお得なセット価格で提供しています。',
      '',
      '**・営業時間**',
      '授業期間中の月曜日から土曜日までの11：00～14：00で営業予定です。',
      '**・平均価格**',
      '平均450円(うどん・そば 200円～選べるランチ600円)',
      '**・決済方法**',
      '現金、電子決済、クレジット',
    ],
  ),
  CafeteriaInfo(
    title: 'シダックス (19号館1階)',
    body: [
      'コロナの影響でお休みしていた焼き立てPIZZAを再開致しました。ご注文を受けてから生地を伸ばしトッピングするので少々お時間は頂きますが、是非ご賞味ください。',
      '',
      '**・営業時間**',
      '月～金 11:00～14:00',
      '**・平均価格**',
      '平均500円',
      '**・決済方法**',
      '現金、電子決済',
    ],
  ),
];
